fold0
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 620000, 1)    0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 155000, 48)   3888        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 155000, 48)   192         conv1d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 155000, 48)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 38750, 48)    0           activation_1[0][0]               
__________________________________________________________________________________________________
res10_branch2a (Conv1D)         (None, 38750, 48)    6960        max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
bn10_branch2a (BatchNormalizati (None, 38750, 48)    192         res10_branch2a[0][0]             
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 38750, 48)    0           bn10_branch2a[0][0]              
__________________________________________________________________________________________________
res10_branch2b (Conv1D)         (None, 38750, 48)    6960        activation_2[0][0]               
__________________________________________________________________________________________________
bn10_branch2b (BatchNormalizati (None, 38750, 48)    192         res10_branch2b[0][0]             
__________________________________________________________________________________________________
add_1 (Add)                     (None, 38750, 48)    0           bn10_branch2b[0][0]              
                                                                 max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 38750, 48)    192         add_1[0][0]                      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 38750, 48)    0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
res11_branch2a (Conv1D)         (None, 38750, 48)    6960        activation_3[0][0]               
__________________________________________________________________________________________________
bn11_branch2a (BatchNormalizati (None, 38750, 48)    192         res11_branch2a[0][0]             
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 38750, 48)    0           bn11_branch2a[0][0]              
__________________________________________________________________________________________________
res11_branch2b (Conv1D)         (None, 38750, 48)    6960        activation_4[0][0]               
__________________________________________________________________________________________________
bn11_branch2b (BatchNormalizati (None, 38750, 48)    192         res11_branch2b[0][0]             
__________________________________________________________________________________________________
add_2 (Add)                     (None, 38750, 48)    0           bn11_branch2b[0][0]              
                                                                 activation_3[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 38750, 48)    192         add_2[0][0]                      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 38750, 48)    0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
res12_branch2a (Conv1D)         (None, 38750, 48)    6960        activation_5[0][0]               
__________________________________________________________________________________________________
bn12_branch2a (BatchNormalizati (None, 38750, 48)    192         res12_branch2a[0][0]             
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 38750, 48)    0           bn12_branch2a[0][0]              
__________________________________________________________________________________________________
res12_branch2b (Conv1D)         (None, 38750, 48)    6960        activation_6[0][0]               
__________________________________________________________________________________________________
bn12_branch2b (BatchNormalizati (None, 38750, 48)    192         res12_branch2b[0][0]             
__________________________________________________________________________________________________
add_3 (Add)                     (None, 38750, 48)    0           bn12_branch2b[0][0]              
                                                                 activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 38750, 48)    192         add_3[0][0]                      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 38750, 48)    0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 9687, 48)     0           activation_7[0][0]               
__________________________________________________________________________________________________
res20_branch2a (Conv1D)         (None, 9687, 96)     13920       max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
bn20_branch2a (BatchNormalizati (None, 9687, 96)     384         res20_branch2a[0][0]             
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 9687, 96)     0           bn20_branch2a[0][0]              
__________________________________________________________________________________________________
res20_branch2b (Conv1D)         (None, 9687, 96)     27744       activation_8[0][0]               
__________________________________________________________________________________________________
bn20_branch2b (BatchNormalizati (None, 9687, 96)     384         res20_branch2b[0][0]             
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 9687, 96)     0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
add_4 (Add)                     (None, 9687, 96)     0           bn20_branch2b[0][0]              
                                                                 lambda_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 9687, 96)     384         add_4[0][0]                      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 9687, 96)     0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
res21_branch2a (Conv1D)         (None, 9687, 96)     27744       activation_9[0][0]               
__________________________________________________________________________________________________
bn21_branch2a (BatchNormalizati (None, 9687, 96)     384         res21_branch2a[0][0]             
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 9687, 96)     0           bn21_branch2a[0][0]              
__________________________________________________________________________________________________
res21_branch2b (Conv1D)         (None, 9687, 96)     27744       activation_10[0][0]              
__________________________________________________________________________________________________
bn21_branch2b (BatchNormalizati (None, 9687, 96)     384         res21_branch2b[0][0]             
__________________________________________________________________________________________________
add_5 (Add)                     (None, 9687, 96)     0           bn21_branch2b[0][0]              
                                                                 activation_9[0][0]               
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 9687, 96)     384         add_5[0][0]                      
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 9687, 96)     0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
res22_branch2a (Conv1D)         (None, 9687, 96)     27744       activation_11[0][0]              
__________________________________________________________________________________________________
bn22_branch2a (BatchNormalizati (None, 9687, 96)     384         res22_branch2a[0][0]             
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 9687, 96)     0           bn22_branch2a[0][0]              
__________________________________________________________________________________________________
res22_branch2b (Conv1D)         (None, 9687, 96)     27744       activation_12[0][0]              
__________________________________________________________________________________________________
bn22_branch2b (BatchNormalizati (None, 9687, 96)     384         res22_branch2b[0][0]             
__________________________________________________________________________________________________
add_6 (Add)                     (None, 9687, 96)     0           bn22_branch2b[0][0]              
                                                                 activation_11[0][0]              
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 9687, 96)     384         add_6[0][0]                      
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 9687, 96)     0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
res23_branch2a (Conv1D)         (None, 9687, 96)     27744       activation_13[0][0]              
__________________________________________________________________________________________________
bn23_branch2a (BatchNormalizati (None, 9687, 96)     384         res23_branch2a[0][0]             
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 9687, 96)     0           bn23_branch2a[0][0]              
__________________________________________________________________________________________________
res23_branch2b (Conv1D)         (None, 9687, 96)     27744       activation_14[0][0]              
__________________________________________________________________________________________________
bn23_branch2b (BatchNormalizati (None, 9687, 96)     384         res23_branch2b[0][0]             
__________________________________________________________________________________________________
add_7 (Add)                     (None, 9687, 96)     0           bn23_branch2b[0][0]              
                                                                 activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 9687, 96)     384         add_7[0][0]                      
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 9687, 96)     0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 2421, 96)     0           activation_15[0][0]              
__________________________________________________________________________________________________
res30_branch2a (Conv1D)         (None, 2421, 192)    55488       max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
bn30_branch2a (BatchNormalizati (None, 2421, 192)    768         res30_branch2a[0][0]             
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 2421, 192)    0           bn30_branch2a[0][0]              
__________________________________________________________________________________________________
res30_branch2b (Conv1D)         (None, 2421, 192)    110784      activation_16[0][0]              
__________________________________________________________________________________________________
bn30_branch2b (BatchNormalizati (None, 2421, 192)    768         res30_branch2b[0][0]             
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 2421, 192)    0           max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
add_8 (Add)                     (None, 2421, 192)    0           bn30_branch2b[0][0]              
                                                                 lambda_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 2421, 192)    768         add_8[0][0]                      
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 2421, 192)    0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
res31_branch2a (Conv1D)         (None, 2421, 192)    110784      activation_17[0][0]              
__________________________________________________________________________________________________
bn31_branch2a (BatchNormalizati (None, 2421, 192)    768         res31_branch2a[0][0]             
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 2421, 192)    0           bn31_branch2a[0][0]              
__________________________________________________________________________________________________
res31_branch2b (Conv1D)         (None, 2421, 192)    110784      activation_18[0][0]              
__________________________________________________________________________________________________
bn31_branch2b (BatchNormalizati (None, 2421, 192)    768         res31_branch2b[0][0]             
__________________________________________________________________________________________________
add_9 (Add)                     (None, 2421, 192)    0           bn31_branch2b[0][0]              
                                                                 activation_17[0][0]              
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 2421, 192)    768         add_9[0][0]                      
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 2421, 192)    0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
res32_branch2a (Conv1D)         (None, 2421, 192)    110784      activation_19[0][0]              
__________________________________________________________________________________________________
bn32_branch2a (BatchNormalizati (None, 2421, 192)    768         res32_branch2a[0][0]             
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 2421, 192)    0           bn32_branch2a[0][0]              
__________________________________________________________________________________________________
res32_branch2b (Conv1D)         (None, 2421, 192)    110784      activation_20[0][0]              
__________________________________________________________________________________________________
bn32_branch2b (BatchNormalizati (None, 2421, 192)    768         res32_branch2b[0][0]             
__________________________________________________________________________________________________
add_10 (Add)                    (None, 2421, 192)    0           bn32_branch2b[0][0]              
                                                                 activation_19[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 2421, 192)    768         add_10[0][0]                     
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 2421, 192)    0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
res33_branch2a (Conv1D)         (None, 2421, 192)    110784      activation_21[0][0]              
__________________________________________________________________________________________________
bn33_branch2a (BatchNormalizati (None, 2421, 192)    768         res33_branch2a[0][0]             
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 2421, 192)    0           bn33_branch2a[0][0]              
__________________________________________________________________________________________________
res33_branch2b (Conv1D)         (None, 2421, 192)    110784      activation_22[0][0]              
__________________________________________________________________________________________________
bn33_branch2b (BatchNormalizati (None, 2421, 192)    768         res33_branch2b[0][0]             
__________________________________________________________________________________________________
add_11 (Add)                    (None, 2421, 192)    0           bn33_branch2b[0][0]              
                                                                 activation_21[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 2421, 192)    768         add_11[0][0]                     
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 2421, 192)    0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
res34_branch2a (Conv1D)         (None, 2421, 192)    110784      activation_23[0][0]              
__________________________________________________________________________________________________
bn34_branch2a (BatchNormalizati (None, 2421, 192)    768         res34_branch2a[0][0]             
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 2421, 192)    0           bn34_branch2a[0][0]              
__________________________________________________________________________________________________
res34_branch2b (Conv1D)         (None, 2421, 192)    110784      activation_24[0][0]              
__________________________________________________________________________________________________
bn34_branch2b (BatchNormalizati (None, 2421, 192)    768         res34_branch2b[0][0]             
__________________________________________________________________________________________________
add_12 (Add)                    (None, 2421, 192)    0           bn34_branch2b[0][0]              
                                                                 activation_23[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 2421, 192)    768         add_12[0][0]                     
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 2421, 192)    0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
res35_branch2a (Conv1D)         (None, 2421, 192)    110784      activation_25[0][0]              
__________________________________________________________________________________________________
bn35_branch2a (BatchNormalizati (None, 2421, 192)    768         res35_branch2a[0][0]             
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 2421, 192)    0           bn35_branch2a[0][0]              
__________________________________________________________________________________________________
res35_branch2b (Conv1D)         (None, 2421, 192)    110784      activation_26[0][0]              
__________________________________________________________________________________________________
bn35_branch2b (BatchNormalizati (None, 2421, 192)    768         res35_branch2b[0][0]             
__________________________________________________________________________________________________
add_13 (Add)                    (None, 2421, 192)    0           bn35_branch2b[0][0]              
                                                                 activation_25[0][0]              
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 2421, 192)    768         add_13[0][0]                     
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 2421, 192)    0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 605, 192)     0           activation_27[0][0]              
__________________________________________________________________________________________________
res40_branch2a (Conv1D)         (None, 605, 384)     221568      max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
bn40_branch2a (BatchNormalizati (None, 605, 384)     1536        res40_branch2a[0][0]             
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 605, 384)     0           bn40_branch2a[0][0]              
__________________________________________________________________________________________________
res40_branch2b (Conv1D)         (None, 605, 384)     442752      activation_28[0][0]              
__________________________________________________________________________________________________
bn40_branch2b (BatchNormalizati (None, 605, 384)     1536        res40_branch2b[0][0]             
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 605, 384)     0           max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
add_14 (Add)                    (None, 605, 384)     0           bn40_branch2b[0][0]              
                                                                 lambda_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 605, 384)     1536        add_14[0][0]                     
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 605, 384)     0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
res41_branch2a (Conv1D)         (None, 605, 384)     442752      activation_29[0][0]              
__________________________________________________________________________________________________
bn41_branch2a (BatchNormalizati (None, 605, 384)     1536        res41_branch2a[0][0]             
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 605, 384)     0           bn41_branch2a[0][0]              
__________________________________________________________________________________________________
res41_branch2b (Conv1D)         (None, 605, 384)     442752      activation_30[0][0]              
__________________________________________________________________________________________________
bn41_branch2b (BatchNormalizati (None, 605, 384)     1536        res41_branch2b[0][0]             
__________________________________________________________________________________________________
add_15 (Add)                    (None, 605, 384)     0           bn41_branch2b[0][0]              
                                                                 activation_29[0][0]              
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 605, 384)     1536        add_15[0][0]                     
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 605, 384)     0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
res42_branch2a (Conv1D)         (None, 605, 384)     442752      activation_31[0][0]              
__________________________________________________________________________________________________
bn42_branch2a (BatchNormalizati (None, 605, 384)     1536        res42_branch2a[0][0]             
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 605, 384)     0           bn42_branch2a[0][0]              
__________________________________________________________________________________________________
res42_branch2b (Conv1D)         (None, 605, 384)     442752      activation_32[0][0]              
__________________________________________________________________________________________________
bn42_branch2b (BatchNormalizati (None, 605, 384)     1536        res42_branch2b[0][0]             
_______________________________________________________